Repository: lapini99/interactive-cv
Catalog: src/locales/*/messages.po
Languages: es, it

source: 3D Artist
es: Artista 3D
it: Artista 3D

source: 3D modeling and animation
es: Modelado y animación 3D
it: Modellazione e animazione 3D

source: A dude that happened to like computers and stuff related to them.
es: Un chico al que le gustan los ordenadores y esas cosas
it: Un ragazzo al che li piace il computer e tutta sta roba

source: And if you want to see more, feel free to check out my <0>Github</0>
es: Y si quieres ver más, no dudes en visitar mi <0>Github</0>
it: Se vuoi vedere di più, sentiti libero di dare un’occhiata al mio <0>Github</0>

source: As I mentioned before, my passion is video game development. That’s why I’m working on a personal project called <0><1>Numb of Joy</1></0>. It’s a first-person psychological horror game made with Unreal Engine 5.
es: Como ya he comentado antes, mi pasión es el desarrollo de videojuegos. Por eso estoy trabajando en un proyecto personal llamado <0><1>Numb of Joy</1></0>. Es un juego de terror psicológico en primera persona desarrollado con Unreal Engine 5.
it: Come ho detto prima, la mia passione è lo sviluppo di videogiochi. Ecco perché sto lavorando a un progetto personale chiamato <0><1>Numb of Joy</1></0>. È un gioco horror psicologico in prima persona realizzato con Unreal Engine 5.

source: Basically, I do everything. Well, almost. A good friend helps me with music and sound effects.
es: Vamos, que lo hago yo todo. Bueno, casi todo. Tengo un buen amigo que me ayuda con la música y los efectos de sonido.
it: Practicamente, faccio io tutto. Beh, quasi tutto. Un buon amico mi aiuta con la musica e gli effetti sonori.

source: Cats
es: Gatetes
it: Gattini

source: Contributed to the creation of assets for the E3 trailer.
es: Contribuí a la creación de assets para el tráiler de E3.
it: Aiutato nella creazione di asset per il trailer dell’E3.

source: Crafted environments for a fighting game.
es: Hice entornos para un juego de lucha.
it: Fatto scenari per un gioco di lotta.

source: Created an internal tool for online Ikea agents using React, Redux and Axios.
es: Creé una herramienta interna para agentes de Ikea online usando React, Redux y Axios.
it: Sviluppato uno strumento interno per gli agenti online di Ikea usando React, Redux e Axios.

source: Created optimized 3D models for smartphone games.
es: Creé modelos 3D optimizados para juegos de móvil.
it: Fatto modelli 3D ottimizzati per giochi su smartphone.

source: Designed levels for a racing game.
es: Diseñé niveles para un juego de carreras.
it: Fatto livelli per un gioco di corse.

source: Direction, script, and story
es: Dirección, guion y narrativa
it: Direzione, sceneggiatura e storia

source: English
es: Inglés
it: Inglese

source: Final UX Project
es: Proyecto final de UX
it: Progetto finale UX

source: Fixed and developed new features using Vue or React.
es: Arreglar y desarrollar nuevas funcionalidades usando Vue o React.
it: Sistemare e sviluppare nuove funzionalità usando Vue o React.

source: FP Multi-platform Application Development
es: FP Desarrollo de Aplicaciones Multiplataforma
it: FP Sviluppo di Applicazioni Multi-piattaforma

source: FP Technical Artist, 2D/3D Animation and Game Development
es: FP Artista Técnico, Animación 2D/3D y Desarrollo de Videojuegos
it: FP Artista Tecnico, Animazione 2D/3D e Sviluppo di Giochi

source: FP Web Application Development
es: FP Desarrollo de Aplicaciones Web
it: FP Sviluppo di Applicazioni Web

source: Frontend Developer
es: Desarrollador Frontend
it: Sviluppatore Frontend

source: Game Developer
es: Desarrollador de Videojuegos

source: Gaming
es: Los videojuegos
it: I video giochi

source: Generates static website with retrieving MongoDB data with Python and Hugo.
es: Genera un sitio web estático recuperando datos de MongoDB con Python y Hugo.
it: Genera sito web statico recuperando i dati da MongoDB con Python e Hugo.

source: Graphic Design Advanced course
es: Curso Superior de Diseño Gráfico
it: Corso Avanzato di Graphic Design

source: Hello, I'm Alessandro
es: Hola, soy Alessandro
it: Ciao, sono Alessandro

source: Here are a few projects on GitHub I think are worth checking out:
es: Te adjunto algún que otro proyecto que tengo en Git que considero que vale la pena echarle un vistazo:
it: Qui ci sono alcuni progetti su GitHub che penso valga la pena dare un’occhiata:

source: I already mentioned what my dream is. Sure, that’s my dream, but what I really want is a peaceful life where I can spend time doing the things I enjoy and that make me feel good.
es: Antes he comentado cual es mi sueño. Ok, es mi sueño, aún así lo que más busco en esta vida es tener una vida tranquila y poder dedicarle tiempo a las cosas que me gustan y me hacen sentir bien.
it: Come ho già detto, il mio sogno è quello. Certo, quello è il mio sogno, ma quello che voglio davvero è una vita tranquilla dove posso passare del tempo facendo le cose che mi piacciono e che mi fanno stare bene.

source: I also learnt how to build optimized SQL or noSQL databases
es: También aprendí a crear bases de datos SQL o noSQL optimizadas
it: Ho anche imparato a fare database SQL o noSQL ottimizzati

source: I had copy-pasted a big spiel from my LinkedIn profile. But since this is my own website, I don’t need to be all formal.
es: Había copy pasteado una turra que tengo en mi perfil Linkedin. Pero como esta es mi web no hace falta ir de formalito.
it: Avevo fatto copy-paste di un discorsaccio (non so se questa parola esiste xD) dal mio profilo LinkedIn. Ma dato che questo è il mio sito web, non ho bisogno di essere tutto formale.

source: I know this doesn’t really belong in a CV, but I don't mind. My hobbies are:
es: Había copy pasteado una turra que tengo en mi perfil Linkedin. Pero como esta es mi web no hace falta ir de formalito.
it: So che per un CV magari non c'entra molto, ma vabbè. I miei hobby sono:

source: I learnt 3D Modelling and Animation
es: Aprendí Modelado y Animación 3D
it: Ho imparato la Modellazione e l'Animazione 3D

source: I learnt color theories.
es: Aprendí teoría del color
it: Ho imparato le teorie del colore.

source: I learnt how to develop applications with Java and Python.
es: Aprendí a desarrollar aplicaciones con Java y Python.
it: Ho imparato a sviluppare applicazioni con Java e Python.

source: I learnt how to develop applications with Java.
es: Aprendí a desarrollar aplicaciones con Java.
it: Ho imparato a sviluppare applicazioni con Java.

source: I learnt how to develop web apps with PHP and JavaScript.
es: Aprendí a desarrollar aplicaciones web con PHP y JavaScript.
it: Ho imparato a sviluppare applicazioni web con PHP e JavaScript.

source: I learnt how to use Adobe Premiere and After Effects
es: Aprendí a usar Adobe Premiere y After Effects
it: Ho imparato a usare Adobe Premiere e After Effects

source: I learnt SOLID, how to debug and other good coding practices.
es: Aprendí SOLID, cómo debuggear y otras buenas prácticas de programación.
it: Ho imparato SOLID, come fare il debug e altre buone pratiche di programmazione.

source: I masterized Photoshop and Illustrator.
es: Mastericé Photoshop e Illustrator.
it: Ho imparato a usare Photoshop e Illustrator.

source: I’m putting my heart and soul into this project. I’ve always wanted to tell a story that captivates people, helps them forget their real-life problems, and brings them some relief. I truly believe Numb of Joy can do that.
es: En este proyecto estoy poniendo toda mi alma y corazón. Siempre he querido publicar una historia que cautive a la gente para que así no piense en sus problemas reales, para que se distraigan y alivien. Y sé que con Numb of Joy lo voy a conseguir.
it: Sto mettendo anima e cuore in questo progetto. Ho sempre voluto raccontare una storia che catturasse le persone e le aiutasse a dimenticare i problemi della vita reale, che le facesse distrarre e sentire meglio. E so che con Numb of Joy ci riuscirò.

source: Implemented new purchase methods for Ikea Iceland using React, Redux and Axios.
es: Implementé nuevos métodos de compra para Ikea Islandia usando React, Redux y Axios.
it: Implementati nuovi metodi di acquisto per Ikea Islanda usando React, Redux e Axios.

source: In the development, I handle:
es: En el desarrollo me encargo de:
it: Nel progetto mi occupo di:

source: Italian
es: Italiano
it: Italiano

source: Job
es: Trabajo
it: Lavoro

source: Level design
es: Diseño de niveles

source: Making people around me laugh
es: Hacer reír a los que me rodean
it: Far ridere chi mi sta intorno

source: Metal (the music genre, just to be clear)
es: El metal (la música, aclaro por si a caso)
it: Il metal

source: My biggest passion and dream is to become a video game director (Kojima fanboy). I actually started by studying video game development. I wanted to be an artist, and programming used to scare me, but since it’s hard to make a living with art, I went for it and learned to code. Now I see programming as a form of art too. Every artist has their way of painting on their canvas (IDE), and I love that.
es: Mi principal pasión y sueño es ser director de videojuegos (Kojima fanboy). De hecho empecé estudiando desarrollo de videojuegos. Quería ser artista y programar me daba miedo, pero como del arte está difícil vivir le eché cara y aprendí a programar. Ahora también veo la programación como arte. Cada artista tiene su manera de pintar sobre su lienzo (IDE), y eso me encanta.
it: La mia più grande passione e sogno è diventare direttore di videogiochi (Kojima fanboy). Infatti, ho iniziato studiando sviluppo di videogiochi. Volevo fare l’artista e la programmazione mi faceva paura, ma siccome vivere d’arte è difficile, mi sono buttato e ho imparato a programmare. Ora vedo anche la programmazione come una forma d’arte. Ogni artista ha il suo modo di dipingere sulla sua tela (IDE), e questa cosa mi affascina.

source: My life or something
es: Mi vida o algo
it: La mia vita o qualcosa del genere

source: Over the last few years, I’ve specialized in Frontend development. I’ve worked with tools like React and Vue, mostly React. That doesn’t mean I get lost when doing Backend, though. I love learning, so whenever I get the chance to touch something new, I dive into the code or documentation. Or I just ask a teammate.
es: Durante los últimos años me he estado especializando en el desarrollo Frontend. He utilizado herramientas como React y Vue, sobretodo React. Ahora bien, esto no quiere decir que si me das algo de back me pierda. Me gusta aprender, así que siempre que tengo la oportunidad de tocar algo que no sé me pongo a leer código y/o documentación. O directamente le pregunto a un compañero.
it: Negli ultimi anni mi sono specializzato nello sviluppo Frontend. Ho lavorato con strumenti come React e Vue, soprattutto React. Ma questo non vuol dire che se mi dai qualcosa di Backend vado in crisi. Mi piace imparare, quindi ogni volta che posso mettere mano a qualcosa di nuovo, leggo codice e/o documentazione. Oppure chiedo direttamente a un collega.

source: Personal project
es: Proyecto personal
it: Progetto personale

source: Pokédex made with Svelte and TypeScript
es: Pokédex hecha con Svelte y TypeScript
it: Una Pokédex realizzata con Svelte e TypeScript

source: Present
es: Presente
it: Presente

source: Produced renders for stands exhibited at E3 2019, Tokyo Gameshow and merch.
es: Produje renders para stands exhibidos en E3 2019, Tokyo Gameshow y merchandising.
it: Fatti renders per stand esposti all’E3 2019, Tokyo Gameshow e merchandising.

source: Programming
es: Programación
it: Programmazione

source: Redesigned the 3D model of the handheld console in development.
es: Rediseñé el modelo 3D de la consola portátil en desarrollo.
it: Ridisegnato il modello 3D della console portatile in sviluppo.

source: Spanish
es: Español
it: Spagnolo

source: Still, I should introduce myself, that part’s necessary. My name is Alessandro, I’m 26 years old and I’ve been in the software world for almost three years.
es: Aún así me presento, que eso sí hace falta. Me llamo Alessandro, tengo 26 años y llevo casi tres años en el mundo del software.
it: Comunque, mi presento, che quello sì è importante. Mi chiamo Alessandro, ho 26 anni e da quasi tre anni lavoro nel mondo del software.

source: Studies
es: Estudios
it: Studi

source: Switch Language
es: Cambiar idioma
it: Cambia lingua

source: Technologies I know best
es: Tecnologías que mejor sé usar
it: Tecnologie che conosco meglio

source: They also taught me game design and Unity (C#)
es: También me enseñaron diseño de videojuegos y Unity (C#)
it: Mi hanno anche insegnato game design e Unity (C#)

source: They also taught me Unity and how to provide a good User Experience.
es: También me enseñaron Unity y cómo proporcionar una buena experiencia de usuario.
it: Mi hanno anche insegnato Unity e come fornire una buona User Experience.

source: View code on GitHub
es: Ver código en GitHub
it: Vedere codice su GitHub

source: Web Developer Internship
es: Web Developer DUAL
it: Sviluppatore Web

source: Website to CRUD content with an admin panel.
es: Página web para CRUD de contenido con un panel de administración.
it: Sito web per contenuti CRUD con un pannello di amministrazione.

source: Who I am
es: Quién soy
it: Chi sono

source: Work stuff
es: Currele
it: Lavoro

source: Working out, especially hitting the gym
es: Hacer deporte, sobretodo ir al gym
it: Fare sport, soprattutto andare in palestra
